{
    "articles": "THE MORNING JOLT\nELECTIONS\nThe Frozen Political Battlefield\nPresident Joe Biden delivers remarks celebrating Labor Day and honoring America’s workers and unions at the Annual Tri-State Labor Day Parade at Sheet Metal Workers' Local Union 19, in Philadelphia, Pa., September 4, 2023. (Joshua Roberts/Reuters)\nShare\n210 Comments\nListen\nBy JIM GERAGHTY\nSeptember 5, 2023 8:41 AM\nOn the menu today: I’m back in the U.S., and the American political scene is . . . not all that different from when I left. A new Wall Street Journal survey finds that Americans still overwhelmingly think President Biden is too old to serve another four years, still believe the economy is doing poorly, still feel bedeviled by inflation and high prices, and are not itching to sign up for another four years of Biden. In fact, in normal circumstances, the incumbent would look doomed . . . except the same survey also finds that Republican primary voters remain hell-bent on nominating Donald Trump again, leaving the race a toss-up.\nStalemate in the States\nRight now the Democratic Party is going all-in on the health, competence, and popularity of an incumbent president who turns 81 in a few months, who is seen favorably by only 39 percent of the voting public, and whose argument that “Bidenomics” is a modern-day success story has been thoroughly rejected by a majority of the electorate.\nThe new Wall Street Journal survey results released Monday paint a picture of a first-term president who, at first glance, looks like a long shot for a second term:\nAlthough the candidates are only three years apart, 73 percent of voters said they feel Biden is too old to seek a second term, compared with 47 percent of voters who said the same of the 77-year-old Trump. Two-thirds of Democrats said Biden was too old to run again.\nBy an 11-point margin, more voters see Trump rather than Biden as having a record of accomplishments as president — some 40 percent said Biden has such a record, while 51 percent said so of Trump. By an eight-point margin, more voters said Trump has a vision for the future. And by 10 points, more described Trump as mentally up to the presidency. Some 46 percent said that is true of Trump, compared with 36% who said so of Biden.\nNor is this new WSJ survey out of line with the rest of the national public-opinion surveys; Biden’s job-approval rating remains around 40 percent in the FiveThirtyEight average of all polling. Public attitudes about Biden really haven’t changed much since they worsened in late summer and autumn of 2021, after the debacle of the withdrawal from Afghanistan.\nThis summer, the president started touting the state of the economy and talking up “Bidenomics.” Usually, a president wants to take credit for an economy that people like; Biden is running around taking credit for an economy that Americans believe is getting worse. The survey found, “58 percent of voters say the economy has gotten worse over the past two years, whereas only 28 percent say it has gotten better, and nearly three in four say inflation is headed in the wrong direction.” Just 37 percent of registered voters said they approved of the job Biden was doing on the economy, and 59 percent disapproved. The numbers were even worse on inflation, with just 34 percent approving, and 63 percent disapproving.\nMany Americans believe that inflation never went away. When this is pointed out, you’ll find some Democrats denouncing the electorate for perceiving the economy incorrectly. But credit-card debt recently hit a new record, which is an indicator that Americans are still having a hard time paying those new higher prices. The U.S. Department of Agriculture states, “Food prices are expected to grow more slowly in 2023 than in 2022 but still at above historical-average rates. In 2023, all food prices are predicted to increase 5.9 percent, with a prediction interval of 5.3 to 6.5 percent.” If people are paying about 6 percent more than they paid last year to eat, it is not surprising that they’re not rating the economy highly. And also note that gas prices are high by historical standards; last month, the national average for a gallon of gas was $3.95.\nTOP STORIES\nDoes John Fetterman Really Want to Be a Senator?\nThe Pope’s Reign and Ruin\nThe Averageness of Taylor Swift\nIn a normal political environment with a normal political opponent, Biden would be toast.\nBut Joe Biden doesn’t appear likely to face a normal political opponent.\nThe previous day, the WSJ released the portion of the same survey focusing on Republican primary voters across the country, and it showed that the 2024 GOP presidential race continues to be uncompetitive. The story of the race so far isn’t anyone else catching up to Trump; it’s that Ron DeSantis, Trump’s closest competitor, appears to have slid back to the rest of the pack:\nTrump, for now, has no formidable challenger. The former president is the top choice of 59 percent of GOP primary voters, up 11 percentage points since April, when the Journal tested a slightly different field of potential and declared candidates.\nTrump’s lead over his top rival, Florida Gov. Ron DeSantis, has nearly doubled since April to 46 percentage points. At 13 percent support, DeSantis is barely ahead of the rest of the field, none of whom has broken out of single-digit support.\nThe standard defense of the trailing candidates is that it’s early and GOP primary voters aren’t tuned in yet. But at least some of them are. Since the beginning of the year, Trump has added about ten percentage points to his lead, DeSantis has lost ground, and Vivek Ramaswamy has climbed from nothing to about 7 percent in the nationwide polls. Some GOP voters are indeed paying attention.\nThe WSJ survey found Biden and Trump tied at 46 percent each. Biden and Trump have developed an oddly symbiotic dynamic — in that they are both erratic, old, factually challenged candidates with exceptionally high unfavorable ratings. (Biden’s disapproval rating is just under 55 percent, and Trump is knocking at the door of 57 percent.) Biden’s strongest argument for another term is the country’s reluctance to sign on for another four years of Trump. Trump’s strongest argument for a return to the Oval Office is the country’s reluctance to sign on for another four years of Biden.\nAll Our Opinion in Your Inbox\nNR Daily is delivered right to you every afternoon. No charge.\nSUBSCRIBE\nIt may well be that the only man Biden could lose to is Trump, and vice versa. In a strange way, they need each other — or at least the threat of another four years of the other guy to make themselves look good by comparison.\nWatch What They’ve Done, Not What They Promise\nHere’s an observation about the Republican presidential primary: Every now and then, I’ll hear someone express a preference for a candidate with the words, “I like what he’s saying.”\nI don’t want to disparage anyone’s criteria for picking a candidate, but I will note that saying things that you, the voter, like to hear is really just about the easiest part of running for president. You don’t have to actually do anything; you just toss out a bunch of ideas and repeat the ones that get the most applause.\nAnybody can show up and promise, “I’ll do this,” or “I’ll do that.” And the candidates who are really unprepared for the job think it will be easy. There’s only so much a president can do with executive orders, given that the next president of the opposite party can rescind such orders with the stroke of a pen. To really enact lasting changes, a president must be able to persuade Congress to turn his agenda into law. The job of the president isn’t really to run around the country giving speeches that generate applause. The job is to run the executive branch and its 15 departments, and to persuade Congress to enact his ideas into law. Just staffing up the executive branch could be a full-time job; there are roughly 1,200 positions that require Senate confirmation.\nThe best way of measuring what a candidate can do in the Oval Office is looking at what they’ve done with their lives so far. Experience matters, if for no other reason than to demonstrate what this person is likely to do in the future.\nADDENDUM: Once again, thanks to everyone who read the past few weeks’ coverage from Ukraine. On yesterday’s edition of the Three Martini Lunch podcast with Greg Corombos, I elaborated a bit on the good, bad, and crazy of what I saw out there — extraordinarily brave and decent people, absolute horror stories about war crimes and the brutality of the Russian invasion, and sometimes just the most bizarre juxtaposition of the mundane and the astonishing in wartime.\nIn case you missed a day or two, here are the links to the coverage from Ukraine:\nWhat It’s Like to Cross into Ukraine\n‘Putin Will Not Stop’: Ukraine’s Civilian Fighters Prepare for Long War\nWhat Makes Kyiv So Difficult to Conquer\nHow Ukraine’s Museums Memorialize a War That’s Not Over\nWhen the Biggest Land War in Europe Since WWII Comes to Your Suburban Street\nThe Horror in Bucha\nThe Ukrainian Anti-Drone Rooftop Party with Machine Guns\n‘The Front Line Starts at the Water’s Edge’: The War as Seen from Odesa\nRelated reporting from just outside Ukraine:\nPoland’s Pivotal Role\nThe Spectacularly Strange Land of ‘Mini-Russia’\nFor the Washington Post:\nIn Ukraine, war reaches into every corner\nBefore the war, this Ukrainian rabbi was a quiet man. No longer\nNEXT JOLT\nThe Spectacularly Strange Land of ‘Mini-Russia’\nBACK TO THE MORNING JOLT\nShare\n210 Comments\nJIM GERAGHTY is the senior political correspondent of National Review. @jimgeraghty"
}